/*Цикл на кожній ітерації пропонує через prompt ввести число більше 100 (але максимум 10 ітерацій циклу) . 
Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше. 
Якщо користувач вводить більше ста, текст або цикл закінчує всі ітерації, то функція виводить в консоль останній введення користувача і завершує функцію.
*/

function getNum() {
  let num;
  for (let i = 0; i < 10; i++) {
    num = prompt("Введи число >100");
    if (isNaN(num)) {
      break;
    }

    if (num <= 100) {
      alert("введи ще раз");
    } else if (num > 100) {
      break;
    }
  }
  return num;
}
console.log(getNum());
